#include <iostream>

using namespace std;

int main()
{
    int k, n, a, b, win;
    cin>>n>>k;

    a = n / 2 + 1;
    b = k / 2 + 1;

    win = a * b;

    cout << win;

    return 0;

}
// Вибори президента США проходять по непрямій схемі. Спрощено схема виглядає так. Спочатку вибори проходять по виборчих округах, на цих виборах голосують виборці (тобто всі громадяни, які мають право голосу). Потім голосування проходить в колегії виборціів, на цих виборах кожен виборчий округ представлений одним виборцем, який голосує за кандидата, який переміг на виборах в даному виборчому окрузі. Кандидатів у президенти кілька, але реально боротьба розгортається між двома кандидатами від основних партій, тому для перемоги у виборах кандидату потрібно забезпечити строго більше половини голосів у колегії виборців. Але для того, щоб виборець проголосував за даного кандидата, необхідно, щоб в його виборчому окрузі цей кандидат також набрав строго більше половини голосів виборців. Відомі випадки (наприклад, в 2016 році), коли через таку непряму виборчу систему у виборах перемагав кандидат, за якого проголосувало менше виборців, ніж за іншого кандидата, який програв вибори.
// Нехай колегія вибірців складається з N чоловік, тобто є N виборчих округів. Кожен виборчий округ, в свою чергу, складається з K виборців.
// Визначте найменше число виборців, яке могло проголосувати за кандидата, який здобув перемогу в виборах.

// Вхідні дані:
// Вхідний файл містить два натуральних числа N, K (1 ≤ N ≤ 103, 1 ≤ K ≤ 106).
// Вихідні дані:
// У вихідний файл виведіть одне число - знайдену кількість виборців.
// Система оцінювання:
// В даній задачі кожен тест оцінюється окремо.

// Пояснення до прикладу:
// Щоб даний кандидат отримав більшість в колегії виборців, необхідно, щоб 3 з 5 вибірців проголосували за нього, тобто кандидат повинен отримати перемогу в 3 округах. Кожен округ складається з 3 виборців, тому для перемоги в окрузі потрібно набрати 2 голоси в даному окрузі.

