#include <iostream>

using namespace std;

int main()
{
    short k1, k2, v1, v2;
    int roomv, roomk;
    cin>>k1>>k2>>v1>>v2;

    roomv = v1 * v2;
    roomk = k1 * k2;

    if (roomv > roomk){
        cout<<"V";
    }
    if (roomv < roomk){
        cout<<"K";
    }
    if (roomv == roomk){
        cout<<"E";
    }

    return 0;
}

// Катя і Ваня вирішили з'ясувати, чия кімната більше. Катіна і Ваніна кімнати мають форму прямокутників, причому Катіна кімната має розміри А на В метрів, а Ваніна - cС на D метрів.
// Напишіть програму, яка визначить, чия кімната більше: Катіна або Ваніна.
// Формат вхідних даних:
// На введення подається чотири натуральних числа, розділених пробілами: A, B, C, D (1 ≤ A, B, C, D ≤ 1000).
// Формат вихідних даних:
// Якщо Катіна кімната більше, виведіть латинську букву «K». Якщо Ваніна кімната більше, виведіть латинську букву «V». Якщо кімнати мають однакову площу, виведіть латинську букву «E».